text = input()

print(text[2])       # третий символ этой строки;
print(text[-2])      # предпоследний символ этой строки;
print(text[:5])      # первые пять символов этой строки;
print(text[:-2])     # всю строку, кроме последних двух символов;
print(text[::2])     # все символы с четными индексами;
print(text[1::2])    # все символы с нечетными индексами;
print(text[::-1])    # все символы в обратном порядке;
print(text[::-2])    # все символы строки через один в обратном порядке, начиная с последнего.

